{
  "greeting":"Hi, I'm James. 👋",
  "headline":"I'm a junior software developer specializing in Javascript and React, working for a startup in Vancouver BC.",
  "stats":{
    "years": 3, 
    "location":"Vancouver, BC",
    "primaryTech": ["Javascript", "React", "HTML", "CSS", "Next.js", "TypeScript"], 
    "secondaryTech": ["Python", "Django", "PostgreSQL"],
    "education": [
      {
        "school": "Athabasca University",
        "dateAttended": "May 2023 - Present"
      },
      {
        "school":"Brainstation Web Development Bootcamp",
        "dateAttended": "November 2020 - Feburary 2021"
      }
    ],
    "interests" : ["Songwriting", "Music Production", "Cooking", "Video Games"],
    "github": "https://github.com/TjArevalo",
    "linkedin": "https://www.linkedin.com/in/jamesyngson/"
  },
  "about":"Hi there! I'm a junior software developer working for the company EduVerse 3.0, which aims at creating an online game that offers real life rewards via NFT's, donating all proceeds to charity. I am currently in the market for a full-time software developer role.\n\nI started programming in 2020 after being introduced by a friend to the JavaScript language, and subsequently, React. After a number of months experimenting with JavaScript, I made the decision to enrol in the BrainStation Web Development Bootcamp. During these 4 months, I was educated in the fundamentals of web development, and created a mock social media application titled 'Notes to No One' as my capstone project. The project was developed using React for the front end, and Google Firebase as a back end service.\n\nFollowing a number of internships and a website development contract with a fashion designer in Vancouver, I had been approached by a private educational institution called Campus Support regarding a role as an Operations Coordinator for their multiple national brands. Among numerous administrative duties, one project I was heavily involved in was the creation of a social media application aimed at cultivating cohesion between our multiple brands, particularly those which operated nationally. I was responsible for the application's design and user experience, as well as ensuring the application was regularly integrated and monitored by campuses following its initial roll out. My successes in this role are attributed to my values of autonomy, client-focused problem solving, and team based collaboration.\n\nIn early 2023, the CEO of EduVerse 3.0 contacted me regarding a junior development position following a company-wide lay off, in which my former position was affected. I took up my role as a junior developer in late January, 2023. My primary role in EduVerse is the architecture and implementation of a Python back end in conjunction with Django and SQL. My position requires me to work with a number of new technologies, as well as adapt to the constantly changing requirements of our application. Consequently, my successes are due to my ability to be adaptable and work independently to achieve my company goals.\n\nI am committed to my career goal of becoming an Engineering Director. I look at the integration between humanity and technology with optimism, and wish to lead teams that develop products which leave lasting, positive impacts with their users. Outside of work, I am a musician and producer under the moniker 'Soulace', and am working towards a Bachelors in Computer Science @ Athabasca University."
  

}